Repository: serenNan/supacode
Catalog: supacode/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: "%@" can't be deleted right now (another operation is in progress).
zh_hans: “%@” 目前无法删除（有其他操作正在进行）。

source: %@ Optional: %@.
zh_hans: %@ 可选：%@。

source: %@ above. Scroll to them.
zh_hans: 上方有 %@。滚动查看。

source: %@ can't be deleted right now (another operation is in progress).
zh_hans: %@ 目前无法删除（有其他操作正在进行）。

source: %@ failed
zh_hans: %@ 失败

source: %@ group, %@
zh_hans: %@ 分组，%@

source: %@ has no working directory on disk. Restore it or delete the worktree.
zh_hans: %@ 在磁盘上没有工作目录。请恢复它或删除该 Worktree。

source: %@ wants to merge %@ %@ into %@ from %@
zh_hans: %@ 想将 %@ %@ 合并到 %@，来自 %@

source: %@ — Scripts
zh_hans: %@ — 脚本

source: %lld items selected
zh_hans: 已选择 %lld 项

source: %lld open %@
zh_hans: %lld 个未关闭 %@

source: %lld session tabs, %@
zh_hans: %lld 个会话标签页，%@

source: %lld to %lld, out of %lld
zh_hans: %lld 到 %lld，共 %lld

source: %lld unread
zh_hans: %lld 条未读

source: +%lld more
zh_hans: 还有 %lld 个

source: A surface with ID %@ already exists.
zh_hans: ID 为 %@ 的 Surface 已存在。

source: A tab with ID %@ already exists.
zh_hans: ID 为 %@ 的标签页已存在。

source: Actions
zh_hans: 操作

source: Add
zh_hans: 添加

source: Add Local Repository or Folder...
zh_hans: 添加本地仓库或文件夹...

source: Add Remote Repository or Folder...
zh_hans: 添加远程仓库或文件夹...

source: Add Remote Repository…
zh_hans: 添加远程仓库…

source: Add Repository or Folder
zh_hans: 添加仓库或文件夹

source: Add Repository, Folder, or Remote
zh_hans: 添加仓库、文件夹或远程

source: Add a local repository or folder (%@)
zh_hans: 添加本地仓库或文件夹 (%@)

source: Add a repository or folder on an SSH host
zh_hans: 在 SSH 主机上添加仓库或文件夹

source: Add a repository or folder on an SSH host (%@)
zh_hans: 在 SSH 主机上添加仓库或文件夹 (%@)

source: Add a repository over SSH. Its git, agents, scripts, and terminal run on the host while Supacode renders locally.
zh_hans: 通过 SSH 添加仓库。它的 git、agent、脚本和终端在主机上运行，而 Supacode 在本地渲染。

source: Add this remote repository to the sidebar
zh_hans: 将此远程仓库添加到侧边栏

source: Add…
zh_hans: 添加…

source: Advanced agent integration
zh_hans: 高级 agent 集成

source: Agent and terminal notifications appear here.
zh_hans: Agent 与终端通知会显示在这里。

source: Agent badges
zh_hans: Agent 徽章

source: Already used by %@.
zh_hans: 已被 %@ 使用。

source: Always allow deeplink commands without confirmation.
zh_hans: 始终允许 deeplink 命令，无需确认。

source: An https or ssh git URL to clone
zh_hans: 要克隆的 https 或 ssh git URL

source: An ~/.ssh/config alias or a hostname Supacode will pass to ssh
zh_hans: 一个 ~/.ssh/config 别名，或 Supacode 传给 ssh 的主机名

source: Archive %lld worktrees
zh_hans: 归档 %lld 个 Worktree

source: Archive %lld worktrees?
zh_hans: 归档 %lld 个 Worktree？

source: Archive Worktree (%@)
zh_hans: 归档 Worktree (%@)

source: Archive Worktree…
zh_hans: 归档 Worktree…

source: Archive worktree
zh_hans: 归档 Worktree

source: Archive worktree?
zh_hans: 归档 Worktree？

source: Archive worktrees to keep them out of the main list.
zh_hans: 归档 Worktree 以将它们移出主列表。

source: Archived Worktrees
zh_hans: 已归档 Worktree

source: Archived Worktrees (%@)
zh_hans: 已归档 Worktree (%@)

source: Archives the worktree when its pull request is merged.
zh_hans: 当 Worktree 的 Pull Request 合并后归档它。

source: Author
zh_hans: 作者

source: Auto
zh_hans: 自动

source: Automatic Updates
zh_hans: 自动更新

source: Automatically update agent integrations
zh_hans: 自动更新 agent 集成

source: Available actions
zh_hans: 可用操作

source: Back in Worktree History
zh_hans: 在 Worktree 历史中后退

source: Back in Worktree History (%@)
zh_hans: 在 Worktree 历史中后退 (%@)

source: Base ref
zh_hans: 基准 ref

source: Binary File
zh_hans: 二进制文件

source: Binary files have no textual diff.
zh_hans: 二进制文件没有文本 diff。

source: Branch
zh_hans: 分支

source: Branch Name
zh_hans: 分支名称

source: Branch name
zh_hans: 分支名称

source: Branches with `/` like `feature/tools/branch` now nest under collapsible groups, sorted alphabetically. Toggle off to restore custom ordering.
zh_hans: 带 `/` 的分支（如 `feature/tools/branch`）现在会嵌套在可折叠分组下，并按字母顺序排列。关闭此项可恢复自定义排序。

source: CLI Reference
zh_hans: CLI 参考

source: CLI Reference ↗
zh_hans: CLI 参考 ↗

source: Cancel
zh_hans: 取消

source: Cancel (Esc)
zh_hans: 取消 (Esc)

source: Change Shortcut…
zh_hans: 更改快捷键…

source: Changes
zh_hans: 更改

source: Changing the language requires relaunching Supacode.
zh_hans: 更改语言需重新启动 Supacode 后生效。

source: Channel
zh_hans: 渠道

source: Check for Updates (%@)
zh_hans: 检查更新 (%@)

source: Check for Updates now
zh_hans: 立即检查更新

source: Check for Updates...
zh_hans: 检查更新...

source: Check for updates automatically
zh_hans: 自动检查更新

source: Checking GitHub CLI…
zh_hans: 正在检查 GitHub CLI…

source: Checking for issues…
zh_hans: 正在检查 Issues…

source: Checking for pull request…
zh_hans: 正在检查 Pull Request…

source: Checks
zh_hans: 检查

source: Choose the parent folder for the clone
zh_hans: 为克隆选择父文件夹

source: Choose…
zh_hans: 选择…

source: Clone
zh_hans: 克隆

source: Clone Repository
zh_hans: 克隆仓库

source: Clone Repository...
zh_hans: 克隆仓库...

source: Clone Repository…
zh_hans: 克隆仓库…

source: Clone a remote repository into a local folder
zh_hans: 将远程仓库克隆到本地文件夹

source: Clone a remote repository into a local folder (%@)
zh_hans: 将远程仓库克隆到本地文件夹 (%@)

source: Clone a remote repository into a local folder and add it.
zh_hans: 将远程仓库克隆到本地文件夹并添加它。

source: Clone the repository into the chosen folder (Return)
zh_hans: 将仓库克隆到所选文件夹 (Return)

source: Clone to Location
zh_hans: 克隆到位置

source: Clones into `%@`.
zh_hans: 克隆到 `%@`。

source: Clones the default branch when empty.
zh_hans: 留空时克隆默认分支。

source: Close
zh_hans: 关闭

source: Close All
zh_hans: 关闭全部

source: Close Other Tabs
zh_hans: 关闭其他标签页

source: Close Tab
zh_hans: 关闭标签页

source: Close Tabs to the Right
zh_hans: 关闭右侧标签页

source: Close Terminal
zh_hans: 关闭终端

source: Close Terminal Tab
zh_hans: 关闭终端标签页

source: Close Window
zh_hans: 关闭窗口

source: Close the diff. (Esc)
zh_hans: 关闭 diff。(Esc)

source: Coding Agents
zh_hans: 编码 Agents

source: Collapse %@
zh_hans: 折叠 %@

source: Collapse All
zh_hans: 全部折叠

source: Collapse all sidebar groups (%@)
zh_hans: 折叠所有侧边栏分组 (%@)

source: Collapse repository section
zh_hans: 折叠仓库区块

source: Collapse session tabs
zh_hans: 折叠会话标签页

source: Color
zh_hans: 颜色

source: Command Line Tool
zh_hans: 命令行工具

source: Command Palette
zh_hans: 命令面板

source: Commands that create resources (%@, %@) print the new UUID to stdout. Capture it to target the resource afterward.
zh_hans: 创建资源的命令（%@、%@）会将新的 UUID 打印到 stdout。捕获它以便之后定位该资源。

source: Commit history
zh_hans: 提交历史

source: Commits
zh_hans: 提交

source: Confirm Action
zh_hans: 确认操作

source: Confirm Action (%@)
zh_hans: 确认操作 (%@)

source: Connect to Remote Host
zh_hans: 连接到远程主机

source: Connecting to remote
zh_hans: 正在连接到远程

source: Control Supacode from the terminal.
zh_hans: 从终端控制 Supacode。

source: Copy %@ to the clipboard
zh_hans: 将 %@ 复制到剪贴板

source: Copy Hash
zh_hans: 复制哈希

source: Copy Message
zh_hans: 复制提交信息

source: Copy as Branch Name
zh_hans: 复制为分支名

source: Copy as Pathname
zh_hans: 复制为路径名

source: Copy command
zh_hans: 复制命令

source: Could not resolve the repository for this worktree.
zh_hans: 无法解析此 Worktree 对应的仓库。

source: Couldn't Load Diff
zh_hans: 无法加载 Diff

source: Couldn't Load History
zh_hans: 无法加载历史

source: Create
zh_hans: 创建

source: Create (↩)
zh_hans: 创建 (↩)

source: Create a branch in `%@`.
zh_hans: 在 `%@` 中创建分支。

source: Created %@
zh_hans: 创建于 %@

source: Creates a shallow clone of the given depth.
zh_hans: 创建指定深度的浅克隆。

source: Customize Appearance
zh_hans: 自定义外观

source: Customize Appearance…
zh_hans: 自定义外观…

source: Deeplink Reference
zh_hans: Deeplink 参考

source: Deeplink Reference ↗
zh_hans: Deeplink 参考 ↗

source: Default strategy when merging PRs from the command palette.
zh_hans: 从命令面板合并 PR 时的默认策略。

source: Defaults to 22.
zh_hans: 默认为 22。

source: Defaults to the repository name.
zh_hans: 默认为仓库名称。

source: Defaults to your SSH config.
zh_hans: 默认使用你的 SSH 配置。

source: Delete Selected
zh_hans: 删除所选

source: Delete Selected (%@)
zh_hans: 删除所选 (%@)

source: Delete Worktree (%@)
zh_hans: 删除 Worktree (%@)

source: Delete Worktree…
zh_hans: 删除 Worktree…

source: Delete from disk
zh_hans: 从磁盘删除

source: Delete not allowed
zh_hans: 不允许删除

source: Delete this worktree from Supacode.
zh_hans: 从 Supacode 删除此 Worktree。

source: Delete unavailable
zh_hans: 无法删除

source: Delete worktree
zh_hans: 删除 Worktree

source: Deleting the main worktree is not allowed.
zh_hans: 不允许删除主 Worktree。

source: Depth
zh_hans: 深度

source: Diff truncated: showing the first %lld lines.
zh_hans: Diff 已截断：仅显示前 %lld 行。

source: Dismiss
zh_hans: 忽略

source: Dismiss All
zh_hans: 全部忽略

source: Dismiss all notifications.
zh_hans: 忽略所有通知。

source: Do nothing
zh_hans: 不做任何操作

source: Download and install updates automatically
zh_hans: 自动下载并安装更新

source: Downloads updates in the background. You will be prompted to restart to apply them.
zh_hans: 在后台下载更新。将提示你重启以应用更新。

source: Each terminal session exposes %@, %@, %@, and %@ as environment variables. Run %@ to discover the IDs for the current session.
zh_hans: 每个终端会话都会将 %@、%@、%@ 和 %@ 作为环境变量暴露。运行 %@ 可查看当前会话的 ID。

source: Edit Connection
zh_hans: 编辑连接

source: Edit Connection…
zh_hans: 编辑连接…

source: Edit the SSH server, port, user, or path
zh_hans: 编辑 SSH 服务器、端口、用户或路径

source: Enable GitHub Integration
zh_hans: 启用 GitHub 集成

source: Enabled
zh_hans: 已启用

source: Error checking status
zh_hans: 检查状态时出错

source: Exit Split Zoom
zh_hans: 退出分屏缩放

source: Expand %@
zh_hans: 展开 %@

source: Expand All
zh_hans: 全部展开

source: Expand all sidebar groups (%@)
zh_hans: 展开所有侧边栏分组 (%@)

source: Expand repository section
zh_hans: 展开仓库区块

source: Expand session tabs (%lld)
zh_hans: 展开会话标签页 (%lld)

source: Extension in `~/.omp/agent/extensions/` and skill in `~/.omp/agent/skills/`.
zh_hans: 扩展位于 `~/.omp/agent/extensions/`，skill 位于 `~/.omp/agent/skills/`。

source: Extension in `~/.pi/agent/extensions/` and skill in `~/.pi/agent/skills/`.
zh_hans: 扩展位于 `~/.pi/agent/extensions/`，skill 位于 `~/.pi/agent/skills/`。

source: Fetch remote branch
zh_hans: 拉取远程分支

source: Find Next
zh_hans: 查找下一个

source: Find Previous
zh_hans: 查找上一个

source: Find...
zh_hans: 查找...

source: Focus pane
zh_hans: 聚焦 Pane

source: Folder Name
zh_hans: 文件夹名称

source: Folder Settings…
zh_hans: 文件夹设置…

source: Follow System
zh_hans: 跟随系统

source: Follows the "Delete local branch with worktree" option in Worktrees settings.
zh_hans: 遵循 Worktrees 设置中的“随 Worktree 删除本地分支”选项。

source: Forward in Worktree History
zh_hans: 在 Worktree 历史中前进

source: Forward in Worktree History (%@)
zh_hans: 在 Worktree 历史中前进 (%@)

source: Get GitHub CLI
zh_hans: 获取 GitHub CLI

source: Get the latest features early.
zh_hans: 抢先体验最新功能。

source: Git unavailable
zh_hans: Git 不可用

source: GitHub CLI not found
zh_hans: 未找到 GitHub CLI

source: GitHub CLI outdated
zh_hans: GitHub CLI 已过时

source: Global
zh_hans: 全局

source: Group Active Rows
zh_hans: 将活跃行分组

source: Group Pinned Rows
zh_hans: 将固定行分组

source: Group Relevant Sidebar Rows
zh_hans: 将相关侧边栏行分组

source: Hide Find Bar
zh_hans: 隐藏查找栏

source: Hide Older
zh_hans: 隐藏较早的

source: Hide Worktree Name on Match
zh_hans: 匹配时隐藏 Worktree 名称

source: Hide this session's older notifications.
zh_hans: 隐藏此会话较早的通知。

source: History
zh_hans: 历史

source: Hooks in `~/.claude/settings.json` and skill in `~/.claude/skills/`.
zh_hans: Hook 位于 `~/.claude/settings.json`，skill 位于 `~/.claude/skills/`。

source: Hooks in `~/.codex/hooks.json` and skill in `~/.codex/skills/`. After installing, trust the hooks in Codex; the badge appears once you send the first message.
zh_hans: Hook 位于 `~/.codex/hooks.json`，skill 位于 `~/.codex/skills/`。安装后，请在 Codex 中信任这些 hook；发送第一条消息后徽章即会出现。

source: Hooks in `~/.copilot/hooks/supacode.json` and skill in `~/.copilot/skills/`.
zh_hans: Hook 位于 `~/.copilot/hooks/supacode.json`，skill 位于 `~/.copilot/skills/`。

source: Hooks in `~/.grok/hooks/supacode.json` and skill in `~/.grok/skills/`.
zh_hans: Hook 位于 `~/.grok/hooks/supacode.json`，skill 位于 `~/.grok/skills/`。

source: Hooks in `~/.kimi/config.toml` and skill in `~/.kimi/skills/`. Hooks system is in Beta.
zh_hans: Hook 位于 `~/.kimi/config.toml`，skill 位于 `~/.kimi/skills/`。Hook 系统处于 Beta 阶段。

source: Hooks in `~/.kiro/agents/` and skill in `~/.kiro/skills/`.
zh_hans: Hook 位于 `~/.kiro/agents/`，skill 位于 `~/.kiro/skills/`。

source: Host
zh_hans: 主机

source: Hotkey
zh_hans: 热键

source: Inside a Supacode terminal, flags default to the current session's IDs. Outside, pass explicit IDs from %@ or %@.
zh_hans: 在 Supacode 终端内，flag 默认使用当前会话的 ID。在终端外，请从 %@ 或 %@ 传入明确的 ID。

source: Install
zh_hans: 安装

source: Install `gh` to enable pull request checks.
zh_hans: 安装 `gh` 以启用 Pull Request 检查。

source: Install hooks and skills to enable rich notifications and presence badges.
zh_hans: 安装 hook 和 skill 以启用丰富通知和在线状态徽章。

source: Installed
zh_hans: 已安装

source: Installing…
zh_hans: 正在安装…

source: Invalid color value
zh_hans: 颜色值无效

source: Invalid deeplink
zh_hans: 无效的 deeplink

source: Issues Unavailable
zh_hans: Issues 不可用

source: Issues need the GitHub integration (`gh` CLI) to be available and enabled.
zh_hans: Issues 需要 GitHub 集成（`gh` CLI）可用并已启用。

source: Jump to Latest Unread
zh_hans: 跳转到最新未读

source: Jump to Latest Unread Notification (%@)
zh_hans: 跳转到最新未读通知 (%@)

source: Language
zh_hans: 语言

source: Loading branches…
zh_hans: 正在加载分支…

source: Loading diff…
zh_hans: 正在加载 diff…

source: Loading history…
zh_hans: 正在加载历史…

source: Local Repository or Folder…
zh_hans: 本地仓库或文件夹…

source: Locked tab
zh_hans: 锁定的标签页

source: Manage Global Scripts…
zh_hans: 管理全局脚本…

source: Manage Repo Scripts…
zh_hans: 管理仓库脚本…

source: Manage in Settings → General
zh_hans: 在设置 → 通用中管理

source: Merge Conflicts
zh_hans: 合并冲突

source: Merge strategy
zh_hans: 合并策略

source: Name
zh_hans: 名称

source: Nest Worktrees by Branch
zh_hans: 按分支嵌套 Worktree

source: New Terminal Tab
zh_hans: 新建终端标签页

source: New Worktree
zh_hans: 新建 Worktree

source: New Worktree (%@)
zh_hans: 新建 Worktree (%@)

source: New Worktree…
zh_hans: 新建 Worktree…

source: No Changes
zh_hans: 无更改

source: No Commits
zh_hans: 无提交

source: No History
zh_hans: 无历史

source: No Notifications
zh_hans: 无通知

source: No Open Issues
zh_hans: 无未关闭的 Issues

source: No Pull Request
zh_hans: 无 Pull Request

source: No bulk action available
zh_hans: 无可用的批量操作

source: No matching branches
zh_hans: 无匹配的分支

source: No repository matching the deeplink could be found.
zh_hans: 找不到与该 deeplink 匹配的仓库。

source: No surface matching the deeplink could be found. It may have been closed.
zh_hans: 找不到与该 deeplink 匹配的 Surface。它可能已被关闭。

source: No tab matching the deeplink could be found. It may have been closed.
zh_hans: 找不到与该 deeplink 匹配的标签页。它可能已被关闭。

source: No tracked changes.
zh_hans: 没有已跟踪的更改。

source: No worktree matching the deeplink could be found. It may have been removed.
zh_hans: 找不到与该 deeplink 匹配的 Worktree。它可能已被移除。

source: Not a Git Repository
zh_hans: 不是 Git 仓库

source: Not authenticated
zh_hans: 未认证

source: Notifications, %lld unread
zh_hans: 通知，%lld 条未读

source: OK
zh_hans: 好

source: Open Pull Request
zh_hans: 打开 Pull Request

source: Open Pull Request (%@)
zh_hans: 打开 Pull Request (%@)

source: Open Repository or Folder (%@)
zh_hans: 打开仓库或文件夹 (%@)

source: Open Repository or Folder...
zh_hans: 打开仓库或文件夹...

source: Open With
zh_hans: 打开方式

source: Open a repository or folder
zh_hans: 打开仓库或文件夹

source: Open a repository or folder on another machine over SSH.
zh_hans: 通过 SSH 打开另一台机器上的仓库或文件夹。

source: Open check details on GitHub
zh_hans: 在 GitHub 上打开检查详情

source: Open check details on GitHub.
zh_hans: 在 GitHub 上打开检查详情。

source: Open folder settings
zh_hans: 打开文件夹设置

source: Open in Editor
zh_hans: 在编辑器中打开

source: Open issue on GitHub.
zh_hans: 在 GitHub 上打开 issue。

source: Open on GitHub
zh_hans: 在 GitHub 上打开

source: Open pull request on GitHub
zh_hans: 在 GitHub 上打开 Pull Request

source: Open pull request on GitHub (%@)
zh_hans: 在 GitHub 上打开 Pull Request (%@)

source: Open pull request on GitHub (%@). Hover to show checks.
zh_hans: 在 GitHub 上打开 Pull Request (%@)。悬停以显示检查。

source: Open pull request on GitHub.
zh_hans: 在 GitHub 上打开 Pull Request。

source: Open repository settings to manage repo scripts.
zh_hans: 打开仓库设置以管理仓库脚本。

source: Open settings to manage global scripts.
zh_hans: 打开设置以管理全局脚本。

source: Open tab %@
zh_hans: 打开标签页 %@

source: Open this file in your default editor.
zh_hans: 在默认编辑器中打开此文件。

source: Open with %@
zh_hans: 用 %@ 打开

source: Open with %@ (%@)
zh_hans: 用 %@ 打开 (%@)

source: Optional
zh_hans: 可选

source: Options
zh_hans: 选项

source: Outgoing
zh_hans: 待推送

source: Override the sidebar title and tint for `%@`.
zh_hans: 覆盖 `%@` 的侧边栏标题和着色。

source: Parent folder
zh_hans: 父文件夹

source: Path
zh_hans: 路径

source: Periodically checks for new versions while Supacode is running.
zh_hans: 在 Supacode 运行时定期检查新版本。

source: Pinned and Active at a glance
zh_hans: 固定与活跃一目了然

source: Pinned worktrees float to the top, and rows with unread notifications, agents awaiting input, or running scripts surface in a new Active section.
zh_hans: 固定的 Worktree 会浮动到顶部，带有未读通知、等待输入的 agent 或正在运行脚本的行会出现在新的“活跃”区块中。

source: Plugin in `~/.config/opencode/plugins/` and skill in `~/.config/opencode/skills/`.
zh_hans: 插件位于 `~/.config/opencode/plugins/`，skill 位于 `~/.config/opencode/skills/`。

source: Plugin in `~/.hermes/plugins/` and skill in `~/.hermes/skills/`.
zh_hans: 插件位于 `~/.hermes/plugins/`，skill 位于 `~/.hermes/skills/`。

source: Port
zh_hans: 端口

source: Pull request checks and merge actions in the command palette.
zh_hans: 命令面板中的 Pull Request 检查和合并操作。

source: Quit Supacode
zh_hans: 退出 Supacode

source: Quit Supacode (⌘Q)
zh_hans: 退出 Supacode (⌘Q)

source: Quit Supacode anytime. Your agents, scripts, and shells keep running, and reopen exactly where you left off.
zh_hans: 随时退出 Supacode。你的 agent、脚本和 shell 会继续运行，重新打开时会恰好回到你离开的位置。

source: Quit Supacode?
zh_hans: 退出 Supacode？

source: Re-install to pick up the latest hooks for these agents.
zh_hans: 重新安装以获取这些 agent 的最新 hook。

source: Re-installs hooks for any agent reporting an outdated integration when Supacode comes to the foreground.
zh_hans: 当 Supacode 切换到前台时，为任何报告集成已过时的 agent 重新安装 hook。

source: Recommended for most users.
zh_hans: 推荐大多数用户使用。

source: Recorded!
zh_hans: 已录制！

source: Recording…
zh_hans: 正在录制…

source: Refresh
zh_hans: 刷新

source: Refresh (%@)
zh_hans: 刷新 (%@)

source: Refresh Worktrees
zh_hans: 刷新 Worktree

source: Relaunch Supacode to Apply
zh_hans: 重新启动 Supacode 以应用

source: Reload commit history.
zh_hans: 重新加载提交历史。

source: Remote Repository or Folder…
zh_hans: 远程仓库或文件夹…

source: Remote host %@
zh_hans: 远程主机 %@

source: Remote repositories
zh_hans: 远程仓库

source: Remove %@?
zh_hans: 移除 %@？

source: Remove Remote Repository…
zh_hans: 移除远程仓库…

source: Remove Repository
zh_hans: 移除仓库

source: Remove Repository…
zh_hans: 移除仓库…

source: Remove folder
zh_hans: 移除文件夹

source: Remove folder?
zh_hans: 移除文件夹？

source: Remove from Supacode
zh_hans: 从 Supacode 移除

source: Remove repository
zh_hans: 移除仓库

source: Remove repository?
zh_hans: 移除仓库？

source: Remove this remote repository (remote files are untouched)
zh_hans: 移除此远程仓库（远程文件不受影响）

source: Remove this repository from Supacode. Files on disk are untouched.
zh_hans: 从 Supacode 移除此仓库。磁盘上的文件不受影响。

source: Removes the repository from Supacode. Nothing on disk is changed.
zh_hans: 从 Supacode 移除该仓库。磁盘上的任何内容都不会更改。

source: Removing repository
zh_hans: 正在移除仓库

source: Rename
zh_hans: 重命名

source: Rename (↩)
zh_hans: 重命名 (↩)

source: Rename Branch
zh_hans: 重命名分支

source: Rename Branch…
zh_hans: 重命名分支…

source: Rename Tab
zh_hans: 重命名标签页

source: Rename `%@` to a new local branch name.
zh_hans: 将 `%@` 重命名为新的本地分支名。

source: Rename tab
zh_hans: 重命名标签页

source: Rename the local branch for this worktree
zh_hans: 重命名此 Worktree 的本地分支

source: Repository Settings
zh_hans: 仓库设置

source: Repository Settings…
zh_hans: 仓库设置…

source: Repository URL
zh_hans: 仓库 URL

source: Repository not found
zh_hans: 未找到仓库

source: Repository unavailable
zh_hans: 仓库不可用

source: Reset to Default
zh_hans: 重置为默认

source: Restore Defaults
zh_hans: 恢复默认

source: Restore all keyboard shortcuts to their defaults?
zh_hans: 将所有快捷键恢复为默认值？

source: Restore all shortcuts to their default values.
zh_hans: 将所有快捷键恢复为默认值。

source: Restore the directory to keep working here, or delete this worktree to clean up.
zh_hans: 恢复目录以继续在此工作，或删除此 Worktree 进行清理。

source: Restore the repository to keep working here, or remove it from Supacode.
zh_hans: 恢复仓库以继续在此工作，或从 Supacode 移除它。

source: Retry
zh_hans: 重试

source: Reveal in Finder
zh_hans: 在 Finder 中显示

source: Reveal in Finder (%@)
zh_hans: 在 Finder 中显示 (%@)

source: Reveal in Sidebar
zh_hans: 在侧边栏中显示

source: Reveal in Sidebar (%@)
zh_hans: 在侧边栏中显示 (%@)

source: Review in Settings
zh_hans: 在设置中查看

source: Rich notifications
zh_hans: 丰富通知

source: Run Command
zh_hans: 运行命令

source: Run Command (↩)
zh_hans: 运行命令 (↩)

source: Run Deeplink Command
zh_hans: 运行 Deeplink 命令

source: Run Script
zh_hans: 运行脚本

source: Run Script (%@)
zh_hans: 运行脚本 (%@)

source: Run `gh auth login` in a terminal to authenticate.
zh_hans: 在终端运行 `gh auth login` 进行认证。

source: Run command in `%@` from `%@`.
zh_hans: 在 `%@` 中运行来自 `%@` 的命令。

source: Run command in `%@`.
zh_hans: 在 `%@` 中运行命令。

source: Run script active
zh_hans: 正在运行脚本

source: Runs `git fetch` to ensure the base branch is up to date before creating the worktree.
zh_hans: 在创建 Worktree 前运行 `git fetch`，以确保基准分支是最新的。

source: Save
zh_hans: 保存

source: Save (↩)
zh_hans: 保存 (↩)

source: Save the connection
zh_hans: 保存连接

source: Script finished. This tab is read-only and won't survive quitting Supacode.
zh_hans: 脚本已结束。此标签页为只读，退出 Supacode 后不会保留。

source: Search for actions or branches...
zh_hans: 搜索操作或分支...

source: Search...
zh_hans: 搜索...

source: Search…
zh_hans: 搜索…

source: Section
zh_hans: 分区

source: Select Next
zh_hans: 选择下一个

source: Select Next (%@)
zh_hans: 选择下一个 (%@)

source: Select Previous
zh_hans: 选择上一个

source: Select Previous (%@)
zh_hans: 选择上一个 (%@)

source: Select Tab
zh_hans: 选择标签页

source: Select Tab %lld
zh_hans: 选择标签页 %lld

source: Select Tab %lld (%@)
zh_hans: 选择标签页 %lld (%@)

source: Select Worktree
zh_hans: 选择 Worktree

source: Select Worktree %lld
zh_hans: 选择 Worktree %lld

source: Select Worktree %lld (%@)
zh_hans: 选择 Worktree %lld (%@)

source: Select a worktree to see its commit history.
zh_hans: 选择一个 Worktree 以查看其提交历史。

source: Select worktree and focus terminal.
zh_hans: 选择 Worktree 并聚焦终端。

source: Server
zh_hans: 服务器

source: Session tab %@%@
zh_hans: 会话标签页 %@%@

source: Sessions persist across quits
zh_hans: 会话在退出后保留

source: Set a custom title or color
zh_hans: 设置自定义标题或颜色

source: Settings
zh_hans: 设置

source: Settings...
zh_hans: 设置...

source: Shortcuts
zh_hans: 快捷键

source: Show %@'s pinned and active worktrees
zh_hans: 显示 %@ 的固定和活跃 Worktree

source: Show %lld Older
zh_hans: 显示较早的 %lld 条

source: Show Main Window
zh_hans: 显示主窗口

source: Show Session Titles
zh_hans: 显示会话标题

source: Show an icon in the sidebar and tab while a coding agent is running in that surface.
zh_hans: 当某个 Surface 中有编码 agent 运行时，在侧边栏和标签页中显示图标。

source: Show changed files.
zh_hans: 显示已更改的文件。

source: Show this file's diff.
zh_hans: 显示此文件的 diff。

source: Show this session's older notifications.
zh_hans: 显示此会话较早的通知。

source: Showing the %lld most recent commits.
zh_hans: 正在显示最近的 %lld 条提交。

source: Signed in as
zh_hans: 登录身份

source: Silently re-applies the canonical hook layout to outdated agent integrations when Supacode activates.
zh_hans: 当 Supacode 激活时，静默地将标准 hook 布局重新应用到已过时的 agent 集成。

source: Stable
zh_hans: 稳定版

source: Stop Script
zh_hans: 停止脚本

source: Stop Script (%@)
zh_hans: 停止脚本 (%@)

source: Stop and notification hooks deliver the agent's last message instead of a generic alert.
zh_hans: Stop 和通知 hook 会传递 agent 的最后一条消息，而不是通用提醒。

source: Submit GitHub Issue
zh_hans: 提交 GitHub Issue

source: Surface ID already exists
zh_hans: Surface ID 已存在

source: Surface not found
zh_hans: 未找到 Surface
